app/Controllers/Home.php

SELECT *
FROM `user_servers`
WHERE `user_email` = 'pemkabbekasi@gmail.com'
---
    public function twoFactorVerificationProcess()
    {
        // Get id from generate_LogID()
        $generatorLogId = new GeneratorController();
        $generatLogId = $generatorLogId->generate_LogID();

        $logActivity = new LogModel();

        // Do a Query based on the email and password of all the data in the user table.
        $email = session()->get('email'); // Get email from input user.
        $modelLogin    = new UserServersModel();
        $dataUser = $modelLogin->where('user_email', $email)->findAll();

INSERT INTO `log_activity` (`id_log`, `id_user`, `category`, `date_time`, `desc_log_activity`, `status_read`) VALUES ('Log_ID_84102288', 'Client_lPjUE_24711', 'Level_2', '2023-07-27 12:29:07', 'Success login, corect OTP Code.', 'read')
---
                    'desc_log_activity'=> 'Success login, corect OTP Code.',
                    'status_read' => 'read'
                ];
                $logActivity->insert($loglogin);

SELECT `user_servers`.*, `servers`.*
FROM `user_servers`
LEFT JOIN `servers` ON `servers`.`id_user` = `user_servers`.`id_user`
WHERE `user_servers`.`level` = 'Client'
---
    public function main()
    {
        // Session untuk memberi nilai property active pada navbar
        session()->set('active', 'main');
        session()->set('active1', '');
        session()->set('subShow', '');
        // ==================================

        $db = \Config\Database::connect();
        $queryUserDataServer = $db  ->table('user_servers')
                                    ->select('user_servers.*, servers.*')
                                    ->join('servers', 'servers.id_user = user_servers.id_user', 'left')
                                    ->where('user_servers.level', 'Client')
                                    ->get();
        $result = $queryUserDataServer->getResultArray();

SELECT `activity_chat`.`id_user`, `activity_chat`.`id_chat`, `activity_chat`.`message_id`, `activity_chat`.`desc_chat`, `activity_chat`.`date_chat`, `activity_chat`.`time_chat`, `ticket_chat`.`subject`, `ticket_chat`.`ticketstatus`, `ticket_chat`.`priority`, `user_servers`.`user_name`, `user_servers`.`foto`
FROM `activity_chat`
JOIN `user_servers` ON `activity_chat`.`id_user` = `user_servers`.`id_user`
JOIN `ticket_chat` ON `activity_chat`.`id_chat` = `ticket_chat`.`id_chat`
WHERE `activity_chat`.`status_read` = 'unread'
AND `activity_chat`.`destination_id_user` = 'Client_lPjUE_24711'
---
        public function getMsg()
        {
            $id_user = session()->get('id_user');
            $db = \Config\Database::connect();
            $level_user = session()->get('level');

            if($level_user == 'Cs'){
                $queryData_1 = $db->table('activity_chat') // MENGAMBIL NOTIF PESAN DARI CLIENT
                    ->select('activity_chat.id_user, activity_chat.id_chat, activity_chat.message_id, activity_chat.desc_chat, activity_chat.date_chat, activity_chat.time_chat, ticket_chat.subject, ticket_chat.ticketstatus, ticket_chat.priority, user_servers.user_name, user_servers.foto')
                    ->join('user_servers', 'activity_chat.id_user = user_servers.id_user')
                    ->join('ticket_chat', 'activity_chat.id_chat = ticket_chat.id_chat')
                    ->where('activity_chat.status_read', 'unread')
                    ->where('activity_chat.assigned_id_cs', $id_user) // BERDASARKAN PEMBUAT TICKET
                    ->get()
                    ->getResultArray();
                $queryData_2 = $db->table('activity_chat') // MENGAMBIL NOTIF PESAN DARI ADMIN
                    ->select('activity_chat.id_user, activity_chat.id_chat, activity_chat.message_id, activity_chat.desc_chat, activity_chat.date_chat, activity_chat.time_chat, ticket_chat.subject, ticket_chat.ticketstatus, ticket_chat.priority, user_servers.user_name, user_servers.foto')
                    ->join('user_servers', 'activity_chat.id_user = user_servers.id_user')
                    ->join('ticket_chat', 'activity_chat.id_chat = ticket_chat.id_chat')
                    ->where('activity_chat.status_read', 'unread')
                    ->where('activity_chat.destination_id_user', $id_user) // BERDASARKAN TUJUAN TICKET
                    ->get()
                    ->getResultArray();

                $queryData = array_merge_recursive($queryData_1, $queryData_2); // MENGGABUNGKAN KEDUA QUERY
                foreach ($queryData as &$msg) { // MENAMBAHKAN INDEX KE DALAM ARRAY $queryData
                    $msg['categori_notif'] = 'message';
                }
                return $this->response->setJSON($queryData); //KEMBALIKAN $queryData DALAM BENTUK JSON
            }else{
                $queryData = $db->table('activity_chat')
                    ->select('activity_chat.id_user, activity_chat.id_chat, activity_chat.message_id, activity_chat.desc_chat, activity_chat.date_chat, activity_chat.time_chat, ticket_chat.subject, ticket_chat.ticketstatus, ticket_chat.priority, user_servers.user_name, user_servers.foto')
                    ->join('user_servers', 'activity_chat.id_user = user_servers.id_user')
                    ->join('ticket_chat', 'activity_chat.id_chat = ticket_chat.id_chat')
                    ->where('activity_chat.status_read', 'unread')
                    ->where('activity_chat.destination_id_user', $id_user)
                    ->get();