app/Controllers/LiveChatController.php

    public function getActivityChat()
    {
        $id_chat = $this->request->getVar('id_chat');

        // MENGAMBIL DATA DARI activity_chat (SEBAGAI ISI OBROLAN), DAN user_servers (SEBAGAI INFORMASI PENGIRIM PESAN).
        $db = \Config\Database::connect();
        $queryData = $db->table('activity_chat')
                        ->select('activity_chat.*','user_servers.*')
                        ->join('user_servers','user_servers.id_user = activity_chat.id_user','left')
                        ->where('activity_chat.id_chat',$id_chat)
                        ->get();
---
SELECT `activity_chat`.*
FROM `activity_chat`
LEFT JOIN `user_servers` ON `user_servers`.`id_user` = `activity_chat`.`id_user`
WHERE `activity_chat`.`id_chat` = 'Ticket_ID_54618'

        public function getUnreadCount()
        {
            $id_user = session()->get('id_user');
            $level_user = session()->get('level');

            $db = \Config\Database::connect();
            // TABEL ACTIVITY_CHAT
            if($level_user == 'Client' || $level_user == 'Admin'){ //CEK LEVEL
                // LAKUKAN QUERY
                $count1 = $db->table('activity_chat')
                            ->selectCount('status_read', 'Count_Unread_Msg') // HITUNG JUMLAH BARIS PADA KOLOM status_read DENGAN ALIAS Count_Unread_Msg, SORTIR BERDASARKAN KONDISI:
                            ->where('status_read', 'unread') // HITUNG JUMLAH BARIS KOLOM status_read BERISI unread, LALU DARI HASIL PENCARIAN DILAKUKAN SORTIR KEMBALI DENGAN KONDISI BERIKUTNYA.
                            ->where('destination_id_user', $id_user) // SETELAH DISORTIR BERDASARKAN unread, SORTIR KEMBALI BERDASARKAN KOLOM destination_id_user DENGAN BERISIKAN ID USER PENGUNA.
                            ->get(); // AMBIL HASIL QUERY YANG SUDAH DISORTIR.
---
SELECT COUNT(`status_read`) AS `Count_Unread_Msg`
FROM `activity_chat`
WHERE `status_read` = 'unread'
AND `destination_id_user` = 'Client_lPjUE_24711'

        public function getUnreadCountNav()
        {
            $id_user = session()->get('id_user');
            $level_user = session()->get('level');

            $db = \Config\Database::connect();
            // TABEL ACTIVITY_CHAT
            if($level_user == 'Client' || $level_user == 'Admin'){ //CEK LEVEL
                // LAKUKAN QUERY
                $count1 = $db->table('activity_chat')
                            ->selectCount('status_read', 'Count_Unread_Msg') // HITUNG JUMLAH BARIS PADA KOLOM status_read DENGAN ALIAS Count_Unread_Msg, SORTIR BERDASARKAN KONDISI:
                            ->where('status_read', 'unread') // HITUNG JUMLAH BARIS KOLOM status_read BERISI unread, LALU DARI HASIL PENCARIAN DILAKUKAN SORTIR KEMBALI DENGAN KONDISI BERIKUTNYA.
                            ->where('destination_id_user', $id_user) // SETELAH DISORTIR BERDASARKAN unread, SORTIR KEMBALI BERDASARKAN KOLOM destination_id_user DENGAN BERISIKAN ID USER PENGUNA.
                            ->get(); // AMBIL HASIL QUERY YANG SUDAH DISORTIR.
---
SELECT COUNT(`status_read`) AS `Count_Unread_Msg`
FROM `activity_chat`
WHERE `status_read` = 'unread'
AND `destination_id_user` = 'Client_lPjUE_24711'

        public function getUnreadCountIdChat()
        {
            $id_user = session()->get('id_user');
            $level_user = session()->get('level');
            $idChatTicket = $this->request->getVar('id_chat');
            // TABEL ACTIVITY_CHAT
            $db = \Config\Database::connect();
            if($level_user == 'Cs'){ // CEK LEVEL
                $query = $db->table('activity_chat')
                            ->selectCount('status_read', 'Count_Unread') // HITUNG JUMLAH BARIS PADA KOLOM status_read DENGAN ALIAS Count_Unread_Msg, SORTIR BERDASARKAN KONDISI:
                            ->where('id_chat', $idChatTicket) // HASIL DI SORTIR KEMBALI BERDASARKAN ID DARI TICKETNYA. (LEBIH SPESIFIK).
                            ->where('assigned_id_cs', $id_user) // SETELAH DISORTIR BERDASARKAN unread, SORTIR KEMBALI BERDASARKAN KOLOM assigned_id_cs DENGAN BERISIKAN ID USER PENGUNA.
                            ->where('status_read', 'unread') // HITUNG JUMLAH BARIS KOLOM status_read BERISI unread, LALU DARI HASIL PENCARIAN DILAKUKAN SORTIR KEMBALI DENGAN KONDISI BERIKUTNYA.
                            ->get(); // AMBIL HASIL QUERY YANG SUDAH DISORTIR.
            }else{
                $query = $db->table('activity_chat')
                            ->selectCount('status_read', 'Count_Unread')
                            ->where('id_chat', $idChatTicket)
                            ->where('destination_id_user', $id_user)
                            ->where('status_read', 'unread')
                            ->get();
---
SELECT COUNT(`status_read`) AS `Count_Unread`
FROM `activity_chat`
WHERE `id_chat` = 'Ticket_ID_13292'
AND `destination_id_user` = 'Client_lPjUE_24711'
AND `status_read` = 'unread'