app/Controllers/serverControler.php

SELECT *
FROM `user_servers`
WHERE `id_user` = 'Admin_idnKa_20301'
SELECT *
FROM `servers`
WHERE `id_user` = 'Admin_idnKa_20301'
---
    public function getServerData()
    {
        $id_user = $this->request->getVar('idUserServer');

        // TABEL USER_SERVERS.
        $dataUserServer = new UserServersModel();
        $temp_dataUserServer = $dataUserServer->where('id_user',$id_user)->findAll();

        // TABEL SERVERS.
        $dataServer = new ServersModel();
        $temp_dataServer = $dataServer->where('id_user',$id_user)->findAll();

SELECT `user_servers`.*, `servers`.*
FROM `user_servers`
LEFT JOIN `servers` ON `servers`.`id_user` = `user_servers`.`id_user`
WHERE `user_servers`.`id_user` = 'Client_lPjUE_24711'
SELECT `user_servers`.*, `servers`.*
FROM `user_servers`
LEFT JOIN `servers` ON `servers`.`id_user` = `user_servers`.`id_user`
WHERE `user_servers`.`level` NOT IN ('Admin','Cs')
---
    public function retrieveServerDataTabel()
    {
        $db = \Config\Database::connect();

        $level_user_login = session()->get('level');
        $user_id_login = session()->get('id_user');
        if($level_user_login == 'Client'){
            $queryUserDataServer = $db  ->table('user_servers')
                                        ->select('user_servers.*, servers.*')
                                        ->join('servers', 'servers.id_user = user_servers.id_user', 'left')
                                        ->where('user_servers.id_user', $user_id_login)
                                        ->get();
            $result = $queryUserDataServer->getResultArray(); // BENTUK ARRAY ASSOISIATIF.
            $server['server'] = $result;
            return $this->response->setJSON($server);
        }else{
            $excluded_user_levels = array('Admin', 'Cs');
            $queryUserDataServer = $db  ->table('user_servers')
                                        ->select('user_servers.*, servers.*')
                                        ->join('servers', 'servers.id_user = user_servers.id_user', 'left')
                                        ->whereNotIn('user_servers.level', $excluded_user_levels)
                                        ->get();