app/Models/UserServersModel.php

UPDATE `user_servers` SET `status_active_user` = 1
WHERE `id_user` = 'Client_lPjUE_24711'
---
        public function updateDataUser($updateProfile,$id_user)
        {
            $query = $this->db->table($this->table)->update($updateProfile, array('id_user'=>$id_user));